NOTES = 5
LEVEL = 5
POWER_UP_CHANCE = 0
NOTE_CHANCE = 0


# Записка №1
# [размер шрифта, текст, смещение по Y]
info_card_1 = [[14, "Кажется, ты нашел свою первую информационную карточку!".upper(), 24],
               [14, "В каждой такой содержится информация о современных технологиях ИИ".upper(), 48],
               [14, "Собери 5 карточек, чтобы пройти игру и узнать больше о заданной теме".upper(), 72],
               [12, "Зачастую страхи человека основаны на непонимании природы того или иного явления,", 112],
               [12, "поэтому давайте больше узнаеим о принципах работы ИИ.", 126],
               [12, "То, что все привыкли называть искусственным интелектом, на самом деле", 140],
               [12, "правильнее называть искусственными нейронными сетями (ИНС), так как они", 154],
               [12, "основаны на работе реальных нейронов человеского мозга. Нейроны взаимодействуют", 168],
               [12, "друг с другом с помощью специальных каналов, позволяющих им обмениваться информацией.", 182],
               [12, "Сигналы отдельных нейронов взвешиваются и комбинируются друг с другом перед тем,", 196],
               [12, "как активировать другие нейроны. Каждый нейрон применяет функцию, или преобразование,", 210],
               [12, "к взвешенным входным сигналам перед тем, как проверить, достигнут ли порог его активации.", 224],
               [12, "Нейронные сети в мозгу могут меняться и обновляться, "
                    "включая изменения алгоритма взвешивания", 238],
               [12, "сигналов, передаваемых между нейронами. Это связано с обучением и накоплением опыта.", 252],
               [12, "Эта модель человеческого мозга использовалась в качестве шаблона для воспроизведения", 264],
               [12, "возможностей мозга в компьютерной симуляции — искуственной нейронной сети.", 278],
               [12, "Вот только самый мощный в мире компьютер выполняет 33.86 петафлопс операций в секунду", 292],
               [12, "и потребляет при этом 17.6 Мегаватт, в то время как человеческий мозг", 306],
               [12, "выполняет 1000 петафлопсопераций в секунду, потребляя при этом 20 Ватт энергии.", 320],
               [12, "Так что, человечеству еще предстоит проделать большое количество работы, прежде чем", 334],
               [12, "кремниевые компьютеры смогут составить конкуренцию углеродным.", 348],
               [20, "Нажмите Enter, чтобы закрыть записку".upper(), 400]]
